PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
/*
 * Master (Programmer) - External Device Application
 * Ultra-low power operation: kimagu 2023.10.13
 *   1. MCU in Stop 2 mode (~2 uA)
 *   2. CC2500 in WOR mode (periodic RX sniff at 2.4 GHz)
 *   3. CC2500 GDO0 -> EXTI wakes MCU on beacon detection
 *   4. CC1101 is powered down until communication session
 *
 * Communication flow (LBT-first, same-channel retry):
 *   0. (internal) CC1101 runs LBT over MICS ch 0..9, picks a free channel N
 *   1. CC2500 sends wake-up beacon (2.4 GHz) carrying
 *      DEVICE_ID + MASTER_ID + SESS + CHANNEL=N
 *   2. CC2500 waits for wake-up ACK (Slave echoes DEVICE_ID + MASTER_ID +
 *      SESS + CHANNEL)
 *   3. CC1101 sends POLL / DATA commands on channel N with same-channel LBT
 *      retries (never hops - Slave is camped on N)
 *   4. CC1101 receives responses filtered by SESS + DEVICE_ID + MASTER_ID
 *   5. CC1101 sends SLEEP command to implant
 *   6. Both radios return to idle/sleep
 *
 * If same-channel LBT fails despite retries, the outer session-restart loop
 * re-runs step 0 and picks a new free channel.
 *
 * MCU: STM32U575 Q-series
 * Radios: CC2500 (2.4 GHz wake-up), CC1101 (400 MHz MICS data)
 */

#include "cc1101.h"
#include "cc2500.h"
#include "protocol.h"
#include "stm32u575_lowpower.h"
#include <string.h>

#define AUTH_NONCE_LEN 4U
#define AUTH_TAG_LEN   4U
#define AUTH_ARG_LEN   (AUTH_NONCE_LEN + AUTH_TAG_LEN)
#define STREAM_CFG_SUBCMD 0x01U
#define STREAM_USE_OPTIONAL_NACK 0U
#define STREAM_NACK_MIN_GAP 2U
#define STREAM_LOGICAL_DATA_MAX 17U
#define STREAM_FEC_COPIES 5U

/* ---------- hardware handles ---------- */
static CC1101_HandleTypeDef g_cc1101;
static CC2500_HandleTypeDef g_cc2500;
static LP_HandleTypeDef     g_lp;

/* These would be defined by CubeMX-generated code */
extern SPI_HandleTypeDef hspi1;  /* CC1101 SPI */
extern SPI_HandleTypeDef hspi2;  /* CC2500 SPI */
extern RTC_HandleTypeDef hrtc;

/* ---------- identity (factory-provisioned) ----------
 * g_master_id   : this Master's 4-byte authenticator. Sent on every beacon /
 *                 COMMAND / DATA frame. Slaves are paired to a specific
 *                 g_master_id at factory and reject frames that do not carry
 *                 the expected ID. This is a pre-shared identifier, NOT a
 *                 cryptographic key.
 * g_target_id   : DEVICE_ID of the implant we currently talk to.
 */
static const uint8_t g_master_id[PROTO_MASTER_ID_LEN] =
    {0xAA, 0xBB, 0xCC, 0xDD};
static uint8_t g_target_id[PROTO_DEVICE_ID_LEN] = {0x00, 0x00, 0x00, 0x01};

/* ---------- session state ---------- */
static uint8_t g_seq = 0U;
static uint8_t g_active_channel = 0U;
static uint8_t g_session_id     = PROTO_SESS_UNASSIGNED;
static uint8_t g_next_sess      = 1U;   /* rolling session ID generator */
static uint8_t g_last_rx_seq = 0U;
static bool    g_last_rx_seq_valid = false;
static uint8_t g_poll_nonce[AUTH_NONCE_LEN] = {0};
static uint8_t g_stream_interval_ms = 20U;
static uint8_t g_stream_frame_count = 4U;

typedef struct {
    uint8_t last_stream_seq;
    uint8_t last_waveform_kind;
    uint8_t last_waveform_len;
    uint8_t last_waveform_payload[16];
    uint8_t last_meas_bitmap;
    uint8_t last_meas_payload[12];
    uint8_t last_event_code;
    uint8_t last_event_len;
    uint8_t last_event_payload[12];
} Master_AppRxState;

static Master_AppRxState g_app_rx = {0};

static const uint8_t g_auth_key[16] = {
    0x3A, 0x5C, 0x19, 0xE7, 0xA2, 0x4D, 0x77, 0x10,
    0x91, 0x2B, 0xC4, 0x6E, 0x58, 0xFD, 0x03, 0xAB
};

/* ---------- LBT retry policy (Patch B) ----------
 * Once Master has pre-selected a channel via LBT and advertised it in the
 * 2.4 GHz wake-up beacon, the Slave is expected to reply on that exact
 * channel. If the channel becomes busy (another MICS user enters) we must
 * NOT hop - that would desync the Slave. Instead we retry CCA on the same
 * channel a bounded number of times with a short random back-off. If CCA
 * keeps failing we abort the TX and let the outer session-restart loop
 * re-run wake-up (with a fresh LBT channel selection).
 */
#define MASTER_SAME_CH_RETRIES      3U   /* total CCA attempts per TX */
#define MASTER_SAME_CH_BACKOFF_MS   5U   /* base back-off between CCA attempts */
#define MASTER_SESSION_RESTARTS     2U   /* outer wake-up retries on CCA fail */

/* ---------- forward declarations ---------- */
static void Master_InitHardware(void);
static int  Master_WakeUpImplant(void);
static int  Master_PollImplantData(uint8_t *resp_buf, uint8_t *resp_len);
static int  Master_WriteToImplant(const uint8_t *data, uint8_t len);
static int  Master_SendSleepCommand(void);
static int  Master_CommunicationSession(void);
static int  Master_StreamFromImplant(uint8_t interval_ms, uint8_t frame_count);
static int  Master_ConfigureStreamViaDataWrite(uint8_t interval_ms, uint8_t frame_count);
static int  Master_SendStreamNack(uint8_t missing_from_seq);
static CC1101_Status Master_TxLBT_SameChannel(const uint8_t *tx_buf,
                                              uint8_t tx_len);
static uint32_t Master_Mac32(const uint8_t *buf, uint8_t len);
static void Master_BuildPollAuthArgs(uint8_t sess, uint8_t out[AUTH_ARG_LEN]);
static bool Master_VerifyPollDataAuth(const Proto_Packet *pkt, uint8_t body_off);
static bool Master_VerifyStreamDataAuth(const Proto_Packet *pkt, uint8_t body_off);
typedef struct {
    bool active;
    uint8_t stream_seq;
    uint8_t copy_mask;
    uint8_t logical_len;
    uint8_t logical_data[STREAM_LOGICAL_DATA_MAX];
} Master_StreamReassembly;
static bool Master_StreamReasmIngest(Master_StreamReassembly *ctx,
                                     uint8_t stream_seq,
                                     uint8_t copy_idx,
                                     uint8_t copy_total,
                                     const uint8_t *logical_data,
                                     uint8_t logical_len);
static bool Master_StreamReasmComplete(const Master_StreamReassembly *ctx);
static void Master_HandleLogicalData(const uint8_t *logical_data, uint8_t logical_len);

/* ========================================================================== */
/* Hardware initialization                                                     */
/* ========================================================================== */

static void Master_InitHardware(void)
{
    /* Initialize DWT for microsecond delays */
    CC1101_DWT_DelayInit();

    /* CC1101 handle (400 MHz MICS) */
    g_cc1101.hspi      = &hspi1;
    g_cc1101.cs_port   = GPIOA;
    g_cc1101.cs_pin    = GPIO_PIN_4;
    g_cc1101.miso_port = GPIOA;
    g_cc1101.miso_pin  = GPIO_PIN_6;
    g_cc1101.gdo0_port = GPIOB;
    g_cc1101.gdo0_pin  = GPIO_PIN_0;

    /* CC2500 handle (2.4 GHz wake-up) */
    g_cc2500.hspi      = &hspi2;
    g_cc2500.cs_port   = GPIOB;
    g_cc2500.cs_pin    = GPIO_PIN_12;
    g_cc2500.miso_port = GPIOB;
    g_cc2500.miso_pin  = GPIO_PIN_14;
    g_cc2500.gdo0_port = GPIOB;
    g_cc2500.gdo0_pin  = GPIO_PIN_1;

